# Reindexing in Pandas DataFrame

Reindexing in Pandas can be used to change the index of rows and columns of a DataFrame. Indexes can be used with reference to many index DataStructure associated with several pandas series or pandas DataFrame. Letâ€™s see how can we Reindex the columns and rows in Pandas DataFrame.

In [1]:
import pandas as pd 
import numpy as np

In [2]:
players={
    "Age":[37,21,33,28,31],
    "Matches":[57,23,65,41,77],
    "Half Centuries":[3,2,3,1,2],
    "Centuries":[1,3,1,1,0,]
}

In [4]:
plyr_df = pd.DataFrame(players, index=["Shoaib Malik","Babar Azam","M.Hafeez","Haris Sohail","Asad Shafiq"])

In [5]:
plyr_df

              Age  Matches  Half Centuries  Centuries
Shoaib Malik   37       57               3          1
Babar Azam     21       23               2          3
M.Hafeez       33       65               3          1
Haris Sohail   28       41               1          1
Asad Shafiq    31       77               2          0

In [6]:
plyr_df.reindex(["Babar Azam","Haris Sohail","M.Hafeez","Shoaib Malik","Asad Shafiq"])

              Age  Matches  Half Centuries  Centuries
Babar Azam     21       23               2          3
Haris Sohail   28       41               1          1
M.Hafeez       33       65               3          1
Shoaib Malik   37       57               3          1
Asad Shafiq    31       77               2          0

In [10]:
new_index = ["Inzamam ul Haq","Haris Sohail","M.Hafeez","Shoaib Malik","Rashid Latif"]

In [11]:
plyr_df.reindex(new_index)

                 Age  Matches  Half Centuries  Centuries
Inzamam ul Haq   NaN      NaN             NaN        NaN
Haris Sohail    28.0     41.0             1.0        1.0
M.Hafeez        33.0     65.0             3.0        1.0
Shoaib Malik    37.0     57.0             3.0        1.0
Rashid Latif     NaN      NaN             NaN        NaN

# Reindexing the columns using axis keyword

One can reindex a single column or multiple columns by using reindex() method and by specifying the axis we want to reindex. Default values in the new index that are not present in the dataframe are assigned NaN.

In [12]:
columns=["Num1","Num2","Half Centuries","Centuries"]

In [16]:
plyr_df.reindex(columns, axis = "columns")

              Num1  Num2  Half Centuries  Centuries
Shoaib Malik   NaN   NaN               3          1
Babar Azam     NaN   NaN               2          3
M.Hafeez       NaN   NaN               3          1
Haris Sohail   NaN   NaN               1          1
Asad Shafiq    NaN   NaN               2          0

# Filling Missing Values

In [17]:
plyr_df.reindex(columns, axis = "columns",fill_value=0)

              Num1  Num2  Half Centuries  Centuries
Shoaib Malik     0     0               3          1
Babar Azam       0     0               2          3
M.Hafeez         0     0               3          1
Haris Sohail     0     0               1          1
Asad Shafiq      0     0               2          0

**Note:**
The main thing is that it doesnot change the orignal data frame Permenently

In [19]:
plyr_df

              Age  Matches  Half Centuries  Centuries
Shoaib Malik   37       57               3          1
Babar Azam     21       23               2          3
M.Hafeez       33       65               3          1
Haris Sohail   28       41               1          1
Asad Shafiq    31       77               2          0

For more visit: https://www.geeksforgeeks.org/reindexing-in-pandas-dataframe/